Revit 2024 API
DefaultDivideSettings.GetSurfaceLayout Method
 Gets the default Divided Surface layout for U or V gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public SpacingRuleLayout GetSurfaceLayout(
	UVGridlineType gridlines
)
Visual Basic
Public Function GetSurfaceLayout ( _
	gridlines As UVGridlineType _
) As SpacingRuleLayout
Visual C++
public:
SpacingRuleLayout GetSurfaceLayout(
	UVGridlineType gridlines
)
Parameters
gridlines
Type: Autodesk.Revit.DB.UVGridlineType
 U-gridlines or V-gridlines.
Return Value
 The layout spacing rule.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace